IRP/src/InformationRegisters/T9510S_Staffing/T9510S_Staffing.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
 <name>T9510S_Staffing</name>
 <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
 <writeMode>RecorderSubordinate</writeMode>
 <resources>
  <name>Fired</name>
  <type>
   <types>Boolean</types>
  </type>
 </resources>
 <resources>
  <name>Branch</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </resources>
 <resources>
  <name>Position</name>
  <type>
   <types>CatalogRef.EmployeePositions</types>
  </type>
 </resources>
 <resources>
  <name>EmployeeSchedule</name>
  <type>
   <types>CatalogRef.EmployeeSchedule</types>
  </type>
 </resources>
 <resources>
  <name>ProfitLossCenter</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </resources>
 <dimensions>
  <name>Employee</name>
  <type>
   <types>CatalogRef.Partners</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
</mdclass:InformationRegister>

IRP/src/InformationRegisters/T9500S_AccrualAndDeductionValues/T9500S_AccrualAndDeductionValues.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
 <name>T9500S_AccrualAndDeductionValues</name>
 <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
 <resources>
  <name>Value</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <resources>
  <name>NotActual</name>
  <type>
   <types>Boolean</types>
  </type>
 </resources>
 <attributes>
  <name>Document</name>
  <type>
   <types>DocumentRef.OpeningEntry</types>
   <types>DocumentRef.EmployeeHiring</types>
   <types>DocumentRef.EmployeeTransfer</types>
  </type>
 </attributes>
 <attributes>
  <name>CancelDocument</name>
  <type>
   <types>DocumentRef.EmployeeTransfer</types>
  </type>
 </attributes>
 <dimensions>
  <name>EmployeeOrPosition</name>
  <type>
   <types>CatalogRef.Partners</types>
   <types>CatalogRef.EmployeePositions</types>
  </type>
 </dimensions>
 <dimensions>
  <name>AccualOrDeductionType</name>
  <type>
   <types>CatalogRef.AccrualAndDeductionTypes</types>
  </type>
 </dimensions>
</mdclass:InformationRegister>

IRP/src/InformationRegisters/T9530S_WorkDays/T9530S_WorkDays.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>T9530S_WorkDays</name>
  <resources>
    <name>CountDaysHours</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Date</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>EmployeeSchedule</name>
    <type>
      <types>CatalogRef.EmployeeSchedule</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

IRP/src/InformationRegisters/T9520S_TimeSheetInfo/T9520S_TimeSheetInfo.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
 <name>T9520S_TimeSheetInfo</name>
 <writeMode>RecorderSubordinate</writeMode>
 <resources>
  <name>CountDaysHours</name>
  <type>
   <types>Number</types>
   <numberQualifiers>
    <precision>3</precision>
   </numberQualifiers>
  </type>
 </resources>
 <resources>
  <name>ActuallyDaysHours</name>
  <type>
   <types>Number</types>
   <numberQualifiers>
    <precision>3</precision>
   </numberQualifiers>
  </type>
 </resources>
 <resources>
  <name>IsVacation</name>
  <type>
   <types>Boolean</types>
  </type>
 </resources>
 <resources>
  <name>IsSickLeave</name>
  <type>
   <types>Boolean</types>
  </type>
 </resources>
 <dimensions>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Branch</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Date</name>
  <type>
   <types>Date</types>
   <dateQualifiers>
    <dateFractions>Date</dateFractions>
   </dateQualifiers>
  </type>
 </dimensions>
 <dimensions>
  <name>Employee</name>
  <type>
   <types>CatalogRef.Partners</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Position</name>
  <type>
   <types>CatalogRef.EmployeePositions</types>
  </type>
 </dimensions>
 <dimensions>
  <name>EmployeeSchedule</name>
  <type>
   <types>CatalogRef.EmployeeSchedule</types>
  </type>
 </dimensions>
 <dimensions>
  <name>ProfitLossCenter</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </dimensions>
</mdclass:InformationRegister>

IRP/src/CommonModules/SalaryServer/Module.bsl
Function GetEmployeeInfo(Ref, Date,  Company, Employee) Export
//	Return ServerReuse.GetEmployeeInfo(Ref, Date, Company, Employee);
	Return _GetEmployeeInfo(Ref, Date, Company, Employee);	
EndFunction

Function _GetEmployeeInfo(Ref, Date,  Company, Employee) Export
	Query = New Query();
	Query.Text = 
	"SELECT
	|	T9510S_StaffingSliceLast.Branch,
	|	T9510S_StaffingSliceLast.Position,
	|	T9510S_StaffingSliceLast.EmployeeSchedule,
	|	T9510S_StaffingSliceLast.ProfitLossCenter
	|FROM
	|	InformationRegister.T9510S_Staffing.SliceLast(&Period, Company = &Company
	|	AND Employee = &Employee) AS T9510S_StaffingSliceLast
	|WHERE
	|	NOT T9510S_StaffingSliceLast.Fired";
	Period = CommonFunctionsClientServer.GetSliceLastDateByRefAndDate(Ref, Date);
	Query.SetParameter("Period"   , Period);
	Query.SetParameter("Company"  , Company);
	Query.SetParameter("Employee" , Employee);
	QueryResult = Query.Execute();
	QuerySelection = QueryResult.Select();
	Result = New Structure("Branch, Position, EmployeeSchedule, ProfitLossCenter");
	If QuerySelection.Next() Then
		FillPropertyValues(Result, QuerySelection);
	EndIf;
	Return Result;
EndFunction

Function GetAccualAndDeductionValue(Date, Employee, Position, AccualOrDeductionType) Export
//	Return ServerReuse.GetAccualAndDeductionValue(Date, Employee, Position, AccualOrDeductionType);
	Return _GetAccualAndDeductionValue(Date, Employee, Position, AccualOrDeductionType);
EndFunction

Function _GetAccualAndDeductionValue(Date, Employee, Position, AccualOrDeductionType) Export
	Query = New Query();
	Query.Text =
		"SELECT
		|	1 AS Prority,
		|	T9500S_ByEmployee.Value
		|INTO tmp
		|FROM
		|	InformationRegister.T9500S_AccrualAndDeductionValues.SliceLast(ENDOFPERIOD(&Date, DAY),
		|		EmployeeOrPosition = &Employee
		|	AND AccualOrDeductionType = &AccualOrDeductionType) AS T9500S_ByEmployee
		|
		|UNION ALL
		|
		|SELECT
		|	2,
		|	T9500S_ByPosition.Value
		|FROM
		|	InformationRegister.T9500S_AccrualAndDeductionValues.SliceLast(ENDOFPERIOD(&Date, DAY),
		|		EmployeeOrPosition = &Position
		|	AND AccualOrDeductionType = &AccualOrDeductionType) AS T9500S_ByPosition
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|SELECT TOP 1
		|	tmp.Prority AS Prority,
		|	tmp.Value
		|FROM
		|	tmp AS tmp
		|
		|ORDER BY
		|	Prority";
	
	Query.SetParameter("Date", Date);
	Query.SetParameter("Position", Position);
	Query.SetParameter("Employee", Employee);
	Query.SetParameter("AccualOrDeductionType", AccualOrDeductionType);
	
	QueryResult = Query.Execute();
	
	QuerySelection = QueryResult.Select();
	
	If QuerySelection.Next() Then
		Return QuerySelection.Value;
	EndIf;
	Return 0;
EndFunction

Function GetWorkDays(BeginDate, EndDate, AccrualAndDeductionType) Export
//	Return ServerReuse.GetWorkDays(BeginDate, EndDate, AccrualAndDeductionType);
	Return _GetWorkDays(BeginDate, EndDate, AccrualAndDeductionType);
EndFunction

Function _GetWorkDays(BeginDate, EndDate, AccrualAndDeductionType) Export
	Query = New Query();
	Query.Text = 
	"SELECT
	|	T9530S_WorkDays.CountDays
	|FROM
	|	InformationRegister.T9530S_WorkDays AS T9530S_WorkDays
	|WHERE
	|	BEGINOFPERIOD(T9530S_WorkDays.BeginDate, DAY) <= BEGINOFPERIOD(&BeginDate, DAY)
	|	AND ENDOFPERIOD(T9530S_WorkDays.EndDate, DAY) >= ENDOFPERIOD(&EndDate, DAY)
	|	AND T9530S_WorkDays.AccrualAndDeductionType = &AccrualAndDeductionType";
	Query.SetParameter("BeginDate"   , BeginDate);		
	Query.SetParameter("EndDate" , EndDate);		
	Query.SetParameter("AccrualAndDeductionType", AccrualAndDeductionType);	
	QueryResult = Query.Execute();
	
	QuerySelection = QueryResult.Select();
	
	If QuerySelection.Next() Then
		Return QuerySelection.CountDays;
	EndIf;
	Return 0;	
EndFunction

Function GetCountDays(Date, Company, Branch, Employee, Position, AccrualAndDeductionType) Export
//	Return ServerReuse.GetCountDays(Date, Company, Branch, Employee, Position, AccrualAndDeductionType);
	Return _GetCountDays(Date, Company, Branch, Employee, Position, AccrualAndDeductionType);
EndFunction

Function _GetCountDays(Date, Company, Branch, Employee, Position, AccrualAndDeductionType) Export
	Query = New Query();
	Query.Text = 
	"SELECT
	|	COUNT(T9520S_TimeSheetInfo.AccrualAndDeductionType) AS CountDays
	|FROM
	|	InformationRegister.T9520S_TimeSheetInfo AS T9520S_TimeSheetInfo
	|WHERE
	|	T9520S_TimeSheetInfo.Company = &Company
	|	AND T9520S_TimeSheetInfo.Branch = &Branch
	|	AND BEGINOFPERIOD(T9520S_TimeSheetInfo.Date, DAY) = &Date
	|	AND T9520S_TimeSheetInfo.Employee = &Employee
	|	AND T9520S_TimeSheetInfo.Position = &Position
	|	AND T9520S_TimeSheetInfo.AccrualAndDeductionType = &AccrualAndDeductionType";
	
	Query.SetParameter("Date"     , BegOfDay(Date));		
	Query.SetParameter("Company"  , Company);		
	Query.SetParameter("Branch"   , Branch);		
	Query.SetParameter("Employee" , Employee);		
	Query.SetParameter("Position" , Position);		
	Query.SetParameter("AccrualAndDeductionType", AccrualAndDeductionType);	
	QueryResult = Query.Execute();
	
	QuerySelection = QueryResult.Select();
	If QuerySelection.Next() And ValueIsFilled(QuerySelection.CountDays) Then
		Return QuerySelection.CountDays;
	EndIf;
	Return 0;
EndFunction
